public class Main {
    /*
    Редактирование документов
В коде, приложенном к уроку в LMS, найдите класс Document в проекте hw_task001
Это модель документа, у него есть список связанных документов List<Document> relatedDocs По бизнес условиям для редактирования документа необходимо получить эксклюзивный доступ ко всем связанным документам.
Естественно, в системе есть множество документов, и они могут одновременно редактироваться из разных потоков.
Посмотрите на класс Document, есть ли в нем потенциальные проблемы при одновременном изменение документов из разных потоков.
если есть,  попробуйте исправить проблему.
     */
    public static void main(String[] args) {

    }
}